Repository: BANSAFAn/FluentLauncher.Preview.Installer
Catalog: FluentLauncher.UniversalInstaller/Properties/Resources.*.resx
Languages: de, ru, uk

# WelcomeTitle
source: 欢迎使用 预览版 Fluent Launcher 启动器 $(arch) 安装向导
de: Willkommen beim Installationsassistenten für Fluent Launcher Preview $(arch)
ru: Добро пожаловать в мастер установки предварительной версии Fluent Launcher $(arch)
uk: Ласкаво просимо до майстра встановлення попередньої версії Fluent Launcher $(arch)

# FinishTitle
source: 完成 预览版 Fluent Launcher 启动器 $(arch) 安装向导
de: Abschluss des Installationsassistenten für Fluent Launcher Preview $(arch)
ru: Завершение мастера установки предварительной версии Fluent Launcher $(arch)
uk: Завершення майстра встановлення попередньої версії Fluent Launcher $(arch)

# FinishInstalled
source: Fluent Launcher 启动器已成功安装
de: Fluent Launcher wurde erfolgreich installiert
ru: Fluent Launcher успешно установлен
uk: Fluent Launcher успішно встановлено

# CustomInstall
source: 自定义安装
de: Benutzerdefinierte Installation
ru: Пользовательская установка
uk: Користувацьке встановлення

# SelectComponents
source: 勾选你想要安装的功能
de: Wählen Sie die Funktionen aus, die Sie installieren möchten
ru: Выберите функции, которые вы хотите установить
uk: Виберіть функції, які ви хочете встановити

# Components
source: 组件
de: Komponenten
ru: Компоненты
uk: Компоненти

# LauncherBody
source: Fluent Launcher (Preview) 启动器本体
de: Fluent Launcher (Preview) Hauptteil
ru: Основное тело Fluent Launcher (Preview)
uk: Основне тіло Fluent Launcher (Preview)

# ConnectXExtension
source: 适用于 Fluent Launcher 的 ConnectX 扩展
de: ConnectX-Erweiterung für Fluent Launcher
ru: Расширение ConnectX для Fluent Launcher
uk: Розширення ConnectX для Fluent Launcher

# DotNetRuntime
source: .NET 桌面运行时 9.0.4
de: .NET Desktop Runtime 9.0.4
ru: .NET Desktop Runtime 9.0.4
uk: .NET Desktop Runtime 9.0.4

# Location
source: 位置：
de: Ort:
ru: Расположение:
uk: Розташування:

# ChangeLocation
source: 我应该如何更改安装位置
de: Wie soll ich den Installationsort ändern
ru: Как изменить место установки
uk: Як змінити місце встановлення

# LicenseTitle
source: 最终用户协议许可
de: Endbenutzer-Lizenzvereinbarung
ru: Лицензионное соглашение конечного пользователя
uk: Ліцензійна угода кінцевого користувача

# ReadLicense
source: 请仔细阅读下面的协议许可
de: Bitte lesen Sie die folgende Lizenzvereinbarung sorgfältig durch
ru: Пожалуйста, внимательно прочитайте следующее лицензионное соглашение
uk: Будь ласка, уважно прочитайте наступну ліцензійну угоду

# AcceptLicense
source: 我接受许可协议中的条款
de: Ich akzeptiere die Bedingungen der Lizenzvereinbarung
ru: Я принимаю условия лицензионного соглашения
uk: Я приймаю умови ліцензійної угоди

# ProgressTitle
source: 正在安装 Fluent Launcher (Preview) 启动器及其他勾选组件
de: Installation von Fluent Launcher (Preview) und anderen ausgewählten Komponenten
ru: Установка Fluent Launcher (Preview) и других выбранных компонентов
uk: Встановлення Fluent Launcher (Preview) та інших вибраних компонентів

# WaitInstall
source: 请等待安装向导安装功能
de: Bitte warten Sie, bis der Installationsassistent die Funktionen installiert
ru: Пожалуйста, подождите, пока мастер установки установит функции
uk: Будь ласка, зачекайте, поки майстер встановлення встановить функції

# Status
source: 状态：
de: Status:
ru: Статус:
uk: Статус:

# InstallError
source: 安装过程中发生错误
de: Bei der Installation ist ein Fehler aufgetreten
ru: Во время установки произошла ошибка
uk: Під час встановлення сталася помилка

# MainWindowTitle
source: 预览版 Fluent Launcher 启动器 $(arch) 安装
de: Installation von Fluent Launcher Preview $(arch)
ru: Установка предварительной версии Fluent Launcher $(arch)
uk: Встановлення попередньої версії Fluent Launcher $(arch)

# Back
source: 上一步
de: Zurück
ru: Назад
uk: Назад

# Cancel
source: 取消
de: Abbrechen
ru: Отмена
uk: Скасувати

# CannotExit
source: 安装过程中不能退出
de: Kann während der Installation nicht beendet werden
ru: Нельзя выйти во время установки
uk: Не можна вийти під час встановлення

# ConfirmExit
source: 你确定要退出 预览版 Fluent Launcher ({SystemHelper.GetArchitecture()}) 安装向导吗？
de: Sind Sie sicher, dass Sie den Installationsassistenten für Fluent Launcher Preview $(arch) beenden möchten?
ru: Вы уверены, что хотите выйти из мастера установки предварительной версии Fluent Launcher ({SystemHelper.GetArchitecture()})?
uk: Ви впевнені, що хочете вийти з майстра встановлення попередньої версії Fluent Launcher ({SystemHelper.GetArchitecture()})?

# RetrievingInfo
source: 正在检索安装所需信息
de: Abrufen der erforderlichen Installationsinformationen
ru: Получение необходимой информации для установки
uk: Отримання необхідної інформації для встановлення

# DownloadingLauncher
source: 正在下载启动器安装包
de: Herunterladen des Launcher-Installationspakets
ru: Загрузка пакета установки лаунчера
uk: Завантаження пакету встановлення лаунчера

# ImportingCertificate
source: 正在导入启动器证书
de: Importieren des Launcher-Zertifikats
ru: Импорт сертификата лаунчера
uk: Імпорт сертифіката лаунчера

# InstallingLauncher
source: 正在安装启动器包
de: Installation des Launcher-Pakets
ru: Установка пакета лаунчера
uk: Встановлення пакету лаунчера

# InstallingDotNet
source: 正在安装 .NET 9.0 Desktop Runtime (v9.0.4) 安装包
de: Installation von .NET 9.0 Desktop Runtime (v9.0.4)
ru: Установка .NET 9.0 Desktop Runtime (v9.0.4)
uk: Встановлення .NET 9.0 Desktop Runtime (v9.0.4)

# AllComponentsInstalled
source: 所有组件安装完成
de: Alle Komponenten installiert
ru: Все компоненты установлены
uk: Всі компоненти встановлено

# NoMatchingVersion
source: 没有找到符合条件的版本
de: Keine passende Version gefunden
ru: Не найдена подходящая версия
uk: Не знайдено відповідної версії

# WelcomeDescription
source: 本安装向导将安装 FluentLauncher 启动器 (Preview) 及其依赖和附属组件到你的计算机。点击 下一步 继续或 取消 退出安装向导。
de: Dieser Installationsassistent installiert den FluentLauncher Launcher (Preview) und seine Abhängigkeiten und zugehörigen Komponenten auf Ihrem Computer. Klicken Sie auf Weiter, um fortzufahren, oder auf Abbrechen, um den Installationsassistenten zu beenden.
uk: Цей майстер встановлення встановить лаунчер FluentLauncher (Preview) та його залежності та пов'язані компоненти на ваш комп'ютер. Натисніть Далі, щоб продовжити, або Скасувати, щоб вийти з майстра встановлення.

# ComponentInstruction
source: 点击下面树中的复选框来改变安装的功能
de: Klicken Sie auf die Kontrollkästchen im Baum unten, um die zu installierenden Funktionen zu ändern
uk: Натисніть на прапорці в дереві нижче, щоб змінити функції для встановлення

# LauncherDescription
source: 基于 .NET 9 以及 WinUI3 技术开发的 Minecraft Java 版启动器，专为 Windows 11 设计的 Minecraft 启动器，提供简洁、流畅的视觉体验
de: Ein Minecraft Java Edition Launcher, der auf .NET 9 und WinUI3-Technologie basiert, ein Minecraft-Launcher, der speziell für Windows 11 entwickelt wurde und ein prägnantes und reibungsloses visuelles Erlebnis bietet
uk: Лаунчер для Minecraft Java Edition, розроблений на базі .NET 9 та технології WinUI3, лаунчер Minecraft, спеціально розроблений для Windows 11, що забезпечує лаконічний та плавний візуальний досвід

# ConnectXDescription
source: 基于 ConnectX 开发的适用于 Fluent Launcher 的插件，提供用户友好的 UI 界面以便方便进行 Minecraft 远程联机
de: Ein Plugin, das auf ConnectX basiert und für Fluent Launcher entwickelt wurde, das eine benutzerfreundliche UI-Oberfläche für bequemes Minecraft-Remote-Multiplayer bietet
uk: Плагін, розроблений на базі ConnectX для Fluent Launcher, що надає зручний користувацький інтерфейс для зручного віддаленого мультиплеєра в Minecraft

# DotNetDescription
source: .NET 桌面运行时使用户能够运行现有 Windows 桌面应用程序。
de: Die .NET Desktop Runtime ermöglicht es Ihnen, bestehende Windows-Desktopanwendungen auszuführen.
uk: Середовище виконання .NET Desktop дозволяє запускати існуючі настільні програми Windows.

# FinishDescription
source: 点击 完成 按钮来退出向导
de: Klicken Sie auf die Schaltfläche Fertig stellen, um den Assistenten zu beenden
uk: Натисніть кнопку Завершити, щоб вийти з майстра

# OpenLauncher
source: 打开 Fluent Launcher 启动器
de: Fluent Launcher öffnen
uk: Відкрити Fluent Launcher

# FailedToLaunch
source: 无法启动应用程序: {0}
de: Fehler beim Starten der Anwendung: {0}
uk: Не вдалося запустити програму: {0}

# DownloadingDotNet
source: 正在下载 .NET 9.0 Desktop Runtime (v9.0.4) 安装包
de: Lade Installationspaket der .NET 9.0 Desktop Runtime (v9.0.4) herunter
uk: Завантаження пакету встановлення .NET 9.0 Desktop Runtime (v9.0.4)

# DownloadingConnectX
source: 正在下载 适用于 Fluent Launcher 的 ConnectX 扩展包
de: Lade ConnectX-Erweiterung für Fluent Launcher herunter
uk: Завантаження розширення ConnectX для Fluent Launcher
